{
  "_name_or_path": "google/bert_uncased_L-2_H-128_A-2",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 128,
  "id2label": {
    "0": "accept",
    "1": "escalate_empty_output",
    "2": "escalate_error",
    "3": "escalate_low_confidence",
    "4": "escalate_risky_diff",
    "5": "escalate_visual_failure",
    "6": "escalate_incomplete"
  },
  "initializer_range": 0.02,
  "intermediate_size": 512,
  "label2id": {
    "accept": 0,
    "escalate_empty_output": 1,
    "escalate_error": 2,
    "escalate_incomplete": 6,
    "escalate_low_confidence": 3,
    "escalate_risky_diff": 4,
    "escalate_visual_failure": 5
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 2,
  "num_hidden_layers": 2,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.44.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
